ROBOTIS-GIT/arduino-esp32/boards.txt
menu.UploadSpeed=Upload Speed
menu.CPUFreq=CPU Frequency
menu.FlashFreq=Flash Frequency
menu.FlashMode=Flash Mode
menu.FlashSize=Flash Size
menu.PartitionScheme=Partition Scheme
menu.DebugLevel=Core Debug Level
menu.PSRAM=PSRAM
menu.Revision=Board Revision

##############################################################

XELNetwork_CommXEL_W.name=CommXEL-W

XELNetwork_CommXEL_W.upload.tool=esptool_py
XELNetwork_CommXEL_W.upload.maximum_size=1310720
XELNetwork_CommXEL_W.upload.maximum_data_size=327680
XELNetwork_CommXEL_W.upload.wait_for_upload_port=true

XELNetwork_CommXEL_W.serial.disableDTR=true
XELNetwork_CommXEL_W.serial.disableRTS=true

XELNetwork_CommXEL_W.build.mcu=esp32
XELNetwork_CommXEL_W.build.core=esp32
XELNetwork_CommXEL_W.build.variant=XELNetwork_CommXEL_W
XELNetwork_CommXEL_W.build.board=CommXEL_W

XELNetwork_CommXEL_W.build.f_cpu=240000000L
XELNetwork_CommXEL_W.build.flash_mode=dio
XELNetwork_CommXEL_W.build.flash_size=4MB
XELNetwork_CommXEL_W.build.boot=dio
XELNetwork_CommXEL_W.build.partitions=default
XELNetwork_CommXEL_W.build.defines=

XELNetwork_CommXEL_W.menu.FlashFreq.80=80MHz
XELNetwork_CommXEL_W.menu.FlashFreq.80.build.flash_freq=80m
XELNetwork_CommXEL_W.menu.FlashFreq.40=40MHz
XELNetwork_CommXEL_W.menu.FlashFreq.40.build.flash_freq=40m

XELNetwork_CommXEL_W.menu.UploadSpeed.921600=921600
XELNetwork_CommXEL_W.menu.UploadSpeed.921600.upload.speed=921600
XELNetwork_CommXEL_W.menu.UploadSpeed.115200=115200
XELNetwork_CommXEL_W.menu.UploadSpeed.115200.upload.speed=115200
XELNetwork_CommXEL_W.menu.UploadSpeed.256000.windows=256000
XELNetwork_CommXEL_W.menu.UploadSpeed.256000.upload.speed=256000
XELNetwork_CommXEL_W.menu.UploadSpeed.230400.windows.upload.speed=256000
XELNetwork_CommXEL_W.menu.UploadSpeed.230400=230400
XELNetwork_CommXEL_W.menu.UploadSpeed.230400.upload.speed=230400
XELNetwork_CommXEL_W.menu.UploadSpeed.460800.linux=460800
XELNetwork_CommXEL_W.menu.UploadSpeed.460800.macosx=460800
XELNetwork_CommXEL_W.menu.UploadSpeed.460800.upload.speed=460800
XELNetwork_CommXEL_W.menu.UploadSpeed.512000.windows=512000
XELNetwork_CommXEL_W.menu.UploadSpeed.512000.upload.speed=512000

XELNetwork_CommXEL_W.menu.DebugLevel.none=None
XELNetwork_CommXEL_W.menu.DebugLevel.none.build.code_debug=0
XELNetwork_CommXEL_W.menu.DebugLevel.error=Error
XELNetwork_CommXEL_W.menu.DebugLevel.error.build.code_debug=1
XELNetwork_CommXEL_W.menu.DebugLevel.warn=Warn
XELNetwork_CommXEL_W.menu.DebugLevel.warn.build.code_debug=2
XELNetwork_CommXEL_W.menu.DebugLevel.info=Info
XELNetwork_CommXEL_W.menu.DebugLevel.info.build.code_debug=3
XELNetwork_CommXEL_W.menu.DebugLevel.debug=Debug
XELNetwork_CommXEL_W.menu.DebugLevel.debug.build.code_debug=4
XELNetwork_CommXEL_W.menu.DebugLevel.verbose=Verbose
XELNetwork_CommXEL_W.menu.DebugLevel.verbose.build.code_debug=5

##############################################################